Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSbcu_bf.h
/**
 * \file IfxSbcu_bf.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:16:00 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Sbcu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Sbcu_Registers
 * 
 */
#ifndef IFXSBCU_BF_H
#define IFXSBCU_BF_H 1
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sbcu_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_SBCU_ID_Bits.MOD_REV */
#define IFX_SBCU_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_SBCU_ID_Bits.MOD_REV */
#define IFX_SBCU_ID_MOD_REV_MSK (0x0u)

/** \brief Offset for Ifx_SBCU_ID_Bits.MOD_REV */
#define IFX_SBCU_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_SBCU_ID_Bits.MOD_NUMBER */
#define IFX_SBCU_ID_MOD_NUMBER_LEN (8u)

/** \brief Mask for Ifx_SBCU_ID_Bits.MOD_NUMBER */
#define IFX_SBCU_ID_MOD_NUMBER_MSK (0xffu)

/** \brief Offset for Ifx_SBCU_ID_Bits.MOD_NUMBER */
#define IFX_SBCU_ID_MOD_NUMBER_OFF (8u)

/** \brief Length for Ifx_SBCU_CON_Bits.TOUT */
#define IFX_SBCU_CON_TOUT_LEN (16u)

/** \brief Mask for Ifx_SBCU_CON_Bits.TOUT */
#define IFX_SBCU_CON_TOUT_MSK (0xffffu)

/** \brief Offset for Ifx_SBCU_CON_Bits.TOUT */
#define IFX_SBCU_CON_TOUT_OFF (0u)

/** \brief Length for Ifx_SBCU_CON_Bits.DBG */
#define IFX_SBCU_CON_DBG_LEN (1u)

/** \brief Mask for Ifx_SBCU_CON_Bits.DBG */
#define IFX_SBCU_CON_DBG_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_CON_Bits.DBG */
#define IFX_SBCU_CON_DBG_OFF (16u)

/** \brief Length for Ifx_SBCU_CON_Bits.SPC */
#define IFX_SBCU_CON_SPC_LEN (8u)

/** \brief Mask for Ifx_SBCU_CON_Bits.SPC */
#define IFX_SBCU_CON_SPC_MSK (0xffu)

/** \brief Offset for Ifx_SBCU_CON_Bits.SPC */
#define IFX_SBCU_CON_SPC_OFF (24u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.CPU2 */
#define IFX_SBCU_PRIOH_CPU2_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.CPU2 */
#define IFX_SBCU_PRIOH_CPU2_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.CPU2 */
#define IFX_SBCU_PRIOH_CPU2_OFF (0u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.CPU3 */
#define IFX_SBCU_PRIOH_CPU3_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.CPU3 */
#define IFX_SBCU_PRIOH_CPU3_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.CPU3 */
#define IFX_SBCU_PRIOH_CPU3_OFF (4u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.CPU4 */
#define IFX_SBCU_PRIOH_CPU4_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.CPU4 */
#define IFX_SBCU_PRIOH_CPU4_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.CPU4 */
#define IFX_SBCU_PRIOH_CPU4_OFF (8u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.CPU5 */
#define IFX_SBCU_PRIOH_CPU5_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.CPU5 */
#define IFX_SBCU_PRIOH_CPU5_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.CPU5 */
#define IFX_SBCU_PRIOH_CPU5_OFF (12u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_OFF (16u)

/** \brief Length for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_OFF (20u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.SFI_S2F */
#define IFX_SBCU_PRIOL_SFI_S2F_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.SFI_S2F */
#define IFX_SBCU_PRIOL_SFI_S2F_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.SFI_S2F */
#define IFX_SBCU_PRIOL_SFI_S2F_OFF (0u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.SDMMC */
#define IFX_SBCU_PRIOL_SDMMC_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.SDMMC */
#define IFX_SBCU_PRIOL_SDMMC_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.SDMMC */
#define IFX_SBCU_PRIOL_SDMMC_OFF (8u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.HSSL0 */
#define IFX_SBCU_PRIOL_HSSL0_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.HSSL0 */
#define IFX_SBCU_PRIOL_HSSL0_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.HSSL0 */
#define IFX_SBCU_PRIOL_HSSL0_OFF (12u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.HSSL1 */
#define IFX_SBCU_PRIOL_HSSL1_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.HSSL1 */
#define IFX_SBCU_PRIOL_HSSL1_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.HSSL1 */
#define IFX_SBCU_PRIOL_HSSL1_OFF (16u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_OFF (24u)

/** \brief Length for Ifx_SBCU_PRIOL_Bits.CPU1 */
#define IFX_SBCU_PRIOL_CPU1_LEN (4u)

/** \brief Mask for Ifx_SBCU_PRIOL_Bits.CPU1 */
#define IFX_SBCU_PRIOL_CPU1_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_PRIOL_Bits.CPU1 */
#define IFX_SBCU_PRIOL_CPU1_OFF (28u)

/** \brief Length for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_LEN (14u)

/** \brief Mask for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_MSK (0x3fffu)

/** \brief Offset for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_OFF (0u)

/** \brief Length for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_LEN (1u)

