Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSbcu_bf.h
/** \brief Mask for Ifx_SBCU_DBCNTL_Bits.ONBOS1 */
#define IFX_SBCU_DBCNTL_ONBOS1_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBCNTL_Bits.ONBOS1 */
#define IFX_SBCU_DBCNTL_ONBOS1_OFF (29u)

/** \brief Length for Ifx_SBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_SBCU_DBCNTL_ONBOS2_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_SBCU_DBCNTL_ONBOS2_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_SBCU_DBCNTL_ONBOS2_OFF (30u)

/** \brief Length for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_OFF (31u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.SFI_S2F */
#define IFX_SBCU_DBGRNT_SFI_S2F_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.SFI_S2F */
#define IFX_SBCU_DBGRNT_SFI_S2F_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.SFI_S2F */
#define IFX_SBCU_DBGRNT_SFI_S2F_OFF (0u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.SDMMC */
#define IFX_SBCU_DBGRNT_SDMMC_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.SDMMC */
#define IFX_SBCU_DBGRNT_SDMMC_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.SDMMC */
#define IFX_SBCU_DBGRNT_SDMMC_OFF (2u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.HSSL0 */
#define IFX_SBCU_DBGRNT_HSSL0_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.HSSL0 */
#define IFX_SBCU_DBGRNT_HSSL0_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.HSSL0 */
#define IFX_SBCU_DBGRNT_HSSL0_OFF (3u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.HSSL1 */
#define IFX_SBCU_DBGRNT_HSSL1_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.HSSL1 */
#define IFX_SBCU_DBGRNT_HSSL1_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.HSSL1 */
#define IFX_SBCU_DBGRNT_HSSL1_OFF (4u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_OFF (6u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_OFF (7u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.CPU2 */
#define IFX_SBCU_DBGRNT_CPU2_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.CPU2 */
#define IFX_SBCU_DBGRNT_CPU2_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.CPU2 */
#define IFX_SBCU_DBGRNT_CPU2_OFF (8u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.CPU3 */
#define IFX_SBCU_DBGRNT_CPU3_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.CPU3 */
#define IFX_SBCU_DBGRNT_CPU3_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.CPU3 */
#define IFX_SBCU_DBGRNT_CPU3_OFF (9u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.CPU4 */
#define IFX_SBCU_DBGRNT_CPU4_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.CPU4 */
#define IFX_SBCU_DBGRNT_CPU4_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.CPU4 */
#define IFX_SBCU_DBGRNT_CPU4_OFF (10u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.CPU5 */
#define IFX_SBCU_DBGRNT_CPU5_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.CPU5 */
#define IFX_SBCU_DBGRNT_CPU5_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.CPU5 */
#define IFX_SBCU_DBGRNT_CPU5_OFF (11u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.HSMRMI */
#define IFX_SBCU_DBGRNT_HSMRMI_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.HSMRMI */
#define IFX_SBCU_DBGRNT_HSMRMI_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.HSMRMI */
#define IFX_SBCU_DBGRNT_HSMRMI_OFF (12u)

/** \brief Length for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_OFF (13u)

/** \brief Length for Ifx_SBCU_DBADR1_Bits.ADR1 */
#define IFX_SBCU_DBADR1_ADR1_LEN (32u)

/** \brief Mask for Ifx_SBCU_DBADR1_Bits.ADR1 */
#define IFX_SBCU_DBADR1_ADR1_MSK (0xffffffffu)

/** \brief Offset for Ifx_SBCU_DBADR1_Bits.ADR1 */
#define IFX_SBCU_DBADR1_ADR1_OFF (0u)

/** \brief Length for Ifx_SBCU_DBADR2_Bits.ADR2 */
#define IFX_SBCU_DBADR2_ADR2_LEN (32u)

/** \brief Mask for Ifx_SBCU_DBADR2_Bits.ADR2 */
#define IFX_SBCU_DBADR2_ADR2_MSK (0xffffffffu)

/** \brief Offset for Ifx_SBCU_DBADR2_Bits.ADR2 */
#define IFX_SBCU_DBADR2_ADR2_OFF (0u)

/** \brief Length for Ifx_SBCU_DBBOS_Bits.OPC */
#define IFX_SBCU_DBBOS_OPC_LEN (4u)

/** \brief Mask for Ifx_SBCU_DBBOS_Bits.OPC */
#define IFX_SBCU_DBBOS_OPC_MSK (0xfu)

/** \brief Offset for Ifx_SBCU_DBBOS_Bits.OPC */
#define IFX_SBCU_DBBOS_OPC_OFF (0u)

/** \brief Length for Ifx_SBCU_DBBOS_Bits.SVM */
#define IFX_SBCU_DBBOS_SVM_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBBOS_Bits.SVM */
#define IFX_SBCU_DBBOS_SVM_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOS_Bits.SVM */
#define IFX_SBCU_DBBOS_SVM_OFF (4u)

/** \brief Length for Ifx_SBCU_DBBOS_Bits.WR */
#define IFX_SBCU_DBBOS_WR_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBBOS_Bits.WR */
#define IFX_SBCU_DBBOS_WR_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOS_Bits.WR */
#define IFX_SBCU_DBBOS_WR_OFF (8u)

/** \brief Length for Ifx_SBCU_DBBOS_Bits.RD */
#define IFX_SBCU_DBBOS_RD_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBBOS_Bits.RD */
#define IFX_SBCU_DBBOS_RD_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOS_Bits.RD */
#define IFX_SBCU_DBBOS_RD_OFF (12u)

/** \brief Length for Ifx_SBCU_DBGNTT_Bits.SFI_S2F */
#define IFX_SBCU_DBGNTT_SFI_S2F_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGNTT_Bits.SFI_S2F */
#define IFX_SBCU_DBGNTT_SFI_S2F_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBGNTT_Bits.SFI_S2F */
#define IFX_SBCU_DBGNTT_SFI_S2F_OFF (0u)

/** \brief Length for Ifx_SBCU_DBGNTT_Bits.SDMMC */
#define IFX_SBCU_DBGNTT_SDMMC_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBGNTT_Bits.SDMMC */
#define IFX_SBCU_DBGNTT_SDMMC_MSK (0x1u)

