Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSbcu_bf.h
/** \brief Offset for Ifx_SBCU_DBBOST_Bits.ENDINIT */
#define IFX_SBCU_DBBOST_ENDINIT_OFF (15u)

/** \brief Length for Ifx_SBCU_DBBOST_Bits.FPITAG */
#define IFX_SBCU_DBBOST_FPITAG_LEN (6u)

/** \brief Mask for Ifx_SBCU_DBBOST_Bits.FPITAG */
#define IFX_SBCU_DBBOST_FPITAG_MSK (0x3fu)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.FPITAG */
#define IFX_SBCU_DBBOST_FPITAG_OFF (16u)

/** \brief Length for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_LEN (32u)

/** \brief Mask for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_OFF (0u)

/** \brief Length for Ifx_SBCU_ALSTAT0_Bits.SBCU_S */
#define IFX_SBCU_ALSTAT0_SBCU_S_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT0_Bits.SBCU_S */
#define IFX_SBCU_ALSTAT0_SBCU_S_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT0_Bits.SBCU_S */
#define IFX_SBCU_ALSTAT0_SBCU_S_OFF (0u)

/** \brief Length for Ifx_SBCU_ALSTAT0_Bits.CERBERUS_S */
#define IFX_SBCU_ALSTAT0_CERBERUS_S_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT0_Bits.CERBERUS_S */
#define IFX_SBCU_ALSTAT0_CERBERUS_S_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT0_Bits.CERBERUS_S */
#define IFX_SBCU_ALSTAT0_CERBERUS_S_OFF (1u)

/** \brief Length for Ifx_SBCU_ALSTAT0_Bits.IR_S */
#define IFX_SBCU_ALSTAT0_IR_S_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT0_Bits.IR_S */
#define IFX_SBCU_ALSTAT0_IR_S_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT0_Bits.IR_S */
#define IFX_SBCU_ALSTAT0_IR_S_OFF (2u)

/** \brief Length for Ifx_SBCU_ALSTAT0_Bits.SFI_F2S_S */
#define IFX_SBCU_ALSTAT0_SFI_F2S_S_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT0_Bits.SFI_F2S_S */
#define IFX_SBCU_ALSTAT0_SFI_F2S_S_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT0_Bits.SFI_F2S_S */
#define IFX_SBCU_ALSTAT0_SFI_F2S_S_OFF (3u)

/** \brief Length for Ifx_SBCU_ALSTAT0_Bits.SCU_S */
#define IFX_SBCU_ALSTAT0_SCU_S_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT0_Bits.SCU_S */
#define IFX_SBCU_ALSTAT0_SCU_S_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT0_Bits.SCU_S */
#define IFX_SBCU_ALSTAT0_SCU_S_OFF (4u)

/** \brief Length for Ifx_SBCU_ALSTAT0_Bits.SMU_S */
#define IFX_SBCU_ALSTAT0_SMU_S_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT0_Bits.SMU_S */
#define IFX_SBCU_ALSTAT0_SMU_S_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT0_Bits.SMU_S */
#define IFX_SBCU_ALSTAT0_SMU_S_OFF (5u)

/** \brief Length for Ifx_SBCU_ALSTAT0_Bits.PMC_S */
#define IFX_SBCU_ALSTAT0_PMC_S_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT0_Bits.PMC_S */
#define IFX_SBCU_ALSTAT0_PMC_S_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT0_Bits.PMC_S */
#define IFX_SBCU_ALSTAT0_PMC_S_OFF (6u)

/** \brief Length for Ifx_SBCU_ALSTAT0_Bits.MTU_S */
#define IFX_SBCU_ALSTAT0_MTU_S_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT0_Bits.MTU_S */
#define IFX_SBCU_ALSTAT0_MTU_S_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT0_Bits.MTU_S */
#define IFX_SBCU_ALSTAT0_MTU_S_OFF (7u)

/** \brief Length for Ifx_SBCU_ALSTAT1_Bits.EVADC_S */
#define IFX_SBCU_ALSTAT1_EVADC_S_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT1_Bits.EVADC_S */
#define IFX_SBCU_ALSTAT1_EVADC_S_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT1_Bits.EVADC_S */
#define IFX_SBCU_ALSTAT1_EVADC_S_OFF (9u)

/** \brief Length for Ifx_SBCU_ALSTAT2_Bits.SBCU_M */
#define IFX_SBCU_ALSTAT2_SBCU_M_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT2_Bits.SBCU_M */
#define IFX_SBCU_ALSTAT2_SBCU_M_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT2_Bits.SBCU_M */
#define IFX_SBCU_ALSTAT2_SBCU_M_OFF (31u)

/** \brief Length for Ifx_SBCU_ALSTAT3_Bits.A_EN */
#define IFX_SBCU_ALSTAT3_A_EN_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT3_Bits.A_EN */
#define IFX_SBCU_ALSTAT3_A_EN_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT3_Bits.A_EN */
#define IFX_SBCU_ALSTAT3_A_EN_OFF (0u)

/** \brief Length for Ifx_SBCU_ALSTAT3_Bits.ABORT_EN */
#define IFX_SBCU_ALSTAT3_ABORT_EN_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT3_Bits.ABORT_EN */
#define IFX_SBCU_ALSTAT3_ABORT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT3_Bits.ABORT_EN */
#define IFX_SBCU_ALSTAT3_ABORT_EN_OFF (1u)

/** \brief Length for Ifx_SBCU_ALSTAT3_Bits.ACK_EN */
#define IFX_SBCU_ALSTAT3_ACK_EN_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT3_Bits.ACK_EN */
#define IFX_SBCU_ALSTAT3_ACK_EN_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT3_Bits.ACK_EN */
#define IFX_SBCU_ALSTAT3_ACK_EN_OFF (2u)

/** \brief Length for Ifx_SBCU_ALSTAT3_Bits.D_EN */
#define IFX_SBCU_ALSTAT3_D_EN_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT3_Bits.D_EN */
#define IFX_SBCU_ALSTAT3_D_EN_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT3_Bits.D_EN */
#define IFX_SBCU_ALSTAT3_D_EN_OFF (3u)

/** \brief Length for Ifx_SBCU_ALSTAT3_Bits.SFI_S2F */
#define IFX_SBCU_ALSTAT3_SFI_S2F_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT3_Bits.SFI_S2F */
#define IFX_SBCU_ALSTAT3_SFI_S2F_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT3_Bits.SFI_S2F */
#define IFX_SBCU_ALSTAT3_SFI_S2F_OFF (16u)

/** \brief Length for Ifx_SBCU_ALSTAT3_Bits.CPU0_M */
#define IFX_SBCU_ALSTAT3_CPU0_M_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT3_Bits.CPU0_M */
#define IFX_SBCU_ALSTAT3_CPU0_M_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT3_Bits.CPU0_M */
#define IFX_SBCU_ALSTAT3_CPU0_M_OFF (22u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR0 */
#define IFX_SBCU_ALCLR_CLR0_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR0 */
#define IFX_SBCU_ALCLR_CLR0_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR0 */
#define IFX_SBCU_ALCLR_CLR0_OFF (0u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR1 */
#define IFX_SBCU_ALCLR_CLR1_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR1 */
#define IFX_SBCU_ALCLR_CLR1_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR1 */
#define IFX_SBCU_ALCLR_CLR1_OFF (1u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR2 */
#define IFX_SBCU_ALCLR_CLR2_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR2 */
#define IFX_SBCU_ALCLR_CLR2_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR2 */
#define IFX_SBCU_ALCLR_CLR2_OFF (2u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR3 */
#define IFX_SBCU_ALCLR_CLR3_LEN (1u)

